04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/simpleRushtonNCC/constant/rotatingZoneProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      rotatingZoneProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

origin    (0 0 0);
axis      (0 0 1);
omega     5 [rpm];

// ************************************************************************* //
