04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/simpleRushtonNCC/system/createBafflesDict.stirrer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict.stirrer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    stirrerGroup // not "stirrer" otherwise clash between group and patch names
    {
        type        faceZone;
        zoneName    stirrer;

        owner
        {
            name        stirrer;
            type        wall;
        }
        neighbour
        {
            $owner;
        }
    }
}


// ************************************************************************* //
